Table of Contents
 Class SteelSetupIND
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Steel setup IND class
public class SteelSetupIND : SteelSetup
Inheritance
object
SteelSetup
SteelSetupIND
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 GammaM0
Partial safety factor for resistance governed by yielding
public double GammaM0 { get; set; }
Property Value
double
 GammaM1
Partial safety factor for resistance governed by ultimate stress
public double GammaM1 { get; set; }
Property Value
double
 GammaMb
Partial safety factor for bolts - bearing type
public double GammaMb { get; set; }
Property Value
double
 GammaMf
Partial safety factor for bolts - friction type
public double GammaMf { get; set; }
Property Value
double
 GammaMw
Partial safety factor for welds
public double GammaMw { get; set; }
Property Value
double
Methods
 FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
public override double FrictionCoefficientPboltDefault()
Returns
double
 Edit this page